espressif/esp-dev-kits/esp32-s3-lcd-ev-board/examples/smart_panel/components/esp32_s3_lcd_ev_board/src/bsp_lvgl_port.c
esp_err_t bsp_lvgl_port_init(esp_lcd_panel_handle_t lcd, esp_lcd_touch_handle_t tp, lv_disp_t **disp, lv_indev_t **indev)
{
    BSP_NULL_CHECK(lcd, ESP_ERR_INVALID_ARG);
    BSP_NULL_CHECK(tp, ESP_ERR_INVALID_ARG);
    BSP_NULL_CHECK(disp, ESP_ERR_INVALID_ARG);
    BSP_NULL_CHECK(indev, ESP_ERR_INVALID_ARG);

    lv_init();
    fs_init();
    BSP_ERROR_CHECK_RETURN_ERR(tick_init());
    BSP_NULL_CHECK(*disp = display_init(lcd), ESP_FAIL);
    BSP_NULL_CHECK(*indev = indev_init(tp), ESP_FAIL);

#if CONFIG_BSP_DISPLAY_LVGL_ROTATION_90
    esp_lcd_touch_set_swap_xy(tp, true);
    esp_lcd_touch_set_mirror_x(tp, true);
#elif CONFIG_BSP_DISPLAY_LVGL_ROTATION_180
    esp_lcd_touch_set_mirror_x(tp, true);
    esp_lcd_touch_set_mirror_y(tp, true);
#elif CONFIG_BSP_DISPLAY_LVGL_ROTATION_270
    esp_lcd_touch_set_swap_xy(tp, true);
    esp_lcd_touch_set_mirror_y(tp, true);
#endif

    lvgl_mux = xSemaphoreCreateRecursiveMutex();
    BSP_NULL_CHECK(lvgl_mux, ESP_FAIL);
    ESP_LOGI(TAG, "Create LVGL task");
    BaseType_t ret = xTaskCreate(
                         lvgl_port_task, "LVGL", CONFIG_BSP_DISPLAY_LVGL_TASK_STACK_SIZE * 1024, NULL,
                         CONFIG_BSP_DISPLAY_LVGL_TASK_PRIORITY, &lvgl_task_handle
                     );
    if (ret != pdPASS) {
        ESP_LOGE(TAG, "Failed to create LVGL task");
        return ESP_FAIL;
    }
#if CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR
    bsp_display_register_trans_done_callback(lcd_trans_done);
#endif

    return ESP_OK;
}

bool bsp_lvgl_port_lock(uint32_t timeout_ms)
{
    assert(lvgl_mux && "bsp_lvgl_port_init must be called first");

    const TickType_t timeout_ticks = (timeout_ms == 0) ? portMAX_DELAY : pdMS_TO_TICKS(timeout_ms);
    return xSemaphoreTakeRecursive(lvgl_mux, timeout_ticks) == pdTRUE;
}

void bsp_lvgl_port_unlock(void)
{
    assert(lvgl_mux && "bsp_lvgl_port_init must be called first");
    xSemaphoreGiveRecursive(lvgl_mux);
}
